import turtle   #เรียกกระดานวาดเต่าออกมา python turtle garphic
tao = turtle.Pen()  #ประกาศค่า tao เป็นปากกาวาด
tao.shape('turtle') #ให้ค่า tao  เป็นรูปเต่า
def Rectangle():    # ประกาศฟังก์ชันวาดรูปสี่เหลี่ยม
    for i in range(4):  # ทำแบบนี้ในช่วง 4 ครั้ง
        tao.forward(100)    # เดินหน้า 100
        tao.left(90)    # หันซ้าย 90 องศา

#Rectangle() #เรียกใช้ฟังก์ชัน 
#tao.clear() #เคลียร์เส้นที่วาดไป

def Go(x,y): #ประกาศค่า Go ไปที่ตำแหน่ง x , y
    tao.penup() # ยกปากกาขึ้น
    tao.goto(x,y) #ไปที่ตำแหน่ง x , y
    tao.pendown() #เมื่อไปถึงตำแหน่งให้จดปากกาลงได้
x = y = -200  #ให้ค่าตั้งต้นพิกัด
for m in range(4):#รอบนอกสี่คอลัมน์
    for n in range(4):# รอบในสี่รูป
        Go(x,y)#ไปที่พิกัด
        Rectangle()#วาดรูปสี่เหลี่ยม
        y = y+100#เพิ่มค่าทีละร้อย(รอบใน)
    y =  y -400#ลบค่าให้กลับมาตำแหน่งตั้งต้น(รอบนอก)
    x = x+100#เพิ่มค่าทีละร้อย(รอบนอก)
Go(0,-100)#ไปที่พิกัด
tao.circle(100)#วาดรูปวงกลมรัศมีหนึ่งร้อย
Go(0,0)#ไปที่พิกัด
tao.left(90)#เต่าหมุนซ้าย90
  

    
